Tekla.Structures.Catalogs.DrawingItemEnumerator.ImportDrawingItem(System.String)
imports a drawing item to the catalog, it fails if no new files are added or if the file doesnt exist or is not a zip file
filename: file to import
Returns: true if ok